/**
 * Задание 1.
 Напиши функцию greet(name), которая возвращает строку "Привет, [name]!"
 **/

// Код задания 1


/** Задание 2.
 * Перепиши функцию `multiply` в виде стрелочной функции.
 * function multiply(a, b) {
 *     return a * b;
 * }
 *  **/

// Код задания 2

/**
 * Задание 3.
 Создай стрелочную функцию sum, которая принимает два числа и возвращает их сумму.
 **/

// Код задания 3



/**
 * Задание 4.
 Напиши функцию isEven(num) — возвращает true, если число чётное, иначе false.
 **/

// Код задания 4


/**
 * Задание 5.
 Напиши функцию formatName(firstName, lastName) возвращает строку вида:
 "Иванов И."
 Важно сокращать имя до 1 символа !
 **/

// Код задания 5


/**
 * Задание 6.
 Напиши функцию translateStatus(code), которая возвращает:
 'success' → 'Успешно'
 'error' → 'Ошибка'
 'pending' → 'В ожидании'
 Если нет соответствия — 'Неизвестно'.
 **/

// Код задания 6


/**
 * Задание 7.
 Функция canLogin(user) возвращает true, если user.isActive === true и user.role === 'admin'.
 **/
// Код задания 7

/**
 * Задание 8.
 Создай функцию, которая принимает любое количество аргументов и выводит их в консоль.
 Используй стрелочную функцию, но помни, что она не имеет объекта `arguments`.
 const showArgs = () => {
    console.log(arguments); // Ошибка: `arguments` не существует в стрелочной функции
 };
    showArgs(1, 2, 3);
 **/

// Код задания 8
