/**
 * Задание 1.
 Напиши функцию greet(name), которая возвращает строку "Привет, [name]!"
 **/

// Код задания 1


/**
 * Задание 2.
 Создай стрелочную функцию sum, которая принимает два числа и возвращает их сумму.
 **/

// Код задания 2



/**
 * Задание 3.
 Напиши функцию isEven(num) — возвращает true, если число чётное, иначе false.
 **/

// Код задания 3


/**
 * Задание 4.
 Напиши функцию formatName(firstName, lastName) возвращает строку вида:
 "Иванов И."
 Важно сокращать имя до 1 символа !
 **/

// Код задания 4


/**
 * Задание 5.
 Напиши функцию translateStatus(code), которая возвращает:
 'success' → 'Успешно'
 'error' → 'Ошибка'
 'pending' → 'В ожидании'
 Если нет соответствия — 'Неизвестно'.
 **/

// Код задания 5


/**
 * Задание 6.
 Функция canLogin(user) возвращает true, если user.isActive === true и user.role === 'admin'.
 **/

// Код задания 6
